api/modules/v1/controllers/AuthController.php

SELECT * FROM `user_login_api` WHERE (`user_id`=11) AND (`expire_at` > NOW())
---
            return $response;
        }

        $api = UserLoginApi::find()->where(['user_id' => $user->id])->andWhere(['>', 'expire_at', new Expression("NOW()")])->one();