api/modules/v1/controllers/TaskCommentController.php

SELECT * FROM `task_comment` WHERE (`task_id`=10) AND (`owner`=11)
---
        $response['status'] = 'success';
        $response += ['response' => []];

        $comments = TaskComment::find()->where(['task_id' => $model->id])->andWhere(['owner' => $model->owner])->all();

SELECT * FROM `task` WHERE (`id`='10') AND (`owner`=11)
---
    public function taskValidate($id, $token, $validate_for_one_comment = true) {
        $validate = $this->tokenValidate($token);
        if(is_array($validate)) {
            return $validate;
        }

        $model = Task::findOne([
            'id' => $id,
            'owner' => $validate
        ]);

SELECT * FROM `user_login_api` WHERE `token`='Bearer 5FiZ3DdE08Ee6ph316t7wz4GN7NPyFmt'
---
            return $response;
        }

        $user_token = UserLoginApi::findOne(['token' => $token]);