api/modules/v1/controllers/TaskController.php

    public function actionViewAll() {
        $token = Yii::$app->request->getHeaders()['Authorization'];

        $response = [
            'status' => '',
            'request' => [
                'token' => $token,
            ],
        ];

        $validate = $this->tokenValidate($token);
        if(is_array($validate)) {
            $response['status'] = 'error';
            $response += $validate;
            return $response;
        }

        $tasks = Task::find()->where(['owner' => $validate])->all();
---
SELECT * FROM `task` WHERE `owner`=11

            return $response;
        }

        $user_token = UserLoginApi::findOne(['token' => $token]);
---
SELECT * FROM `user_login_api` WHERE `token`='Bearer lkmOaMPRP4njoLA9U5cAUoBn20wdWRso'